{{ if true }}
tap "cirruslabs/cli"
tap "homebrew/cask"
brew "age"
brew "atuin", restart_service: :changed
brew "bat"
brew "bottom"
brew "carapace"
brew "chezmoi"
brew "cirruslabs/cli/tart"
brew "direnv"
brew "dockutil"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glab"
brew "glow"
brew "go"
brew "gum"
brew "helix"
brew "jq"
brew "just"
brew "luarocks"
brew "mas"
brew "mise"
brew "neovim"
brew "node"
brew "nushell"
brew "podman"
brew "podman-compose"
brew "pre-commit"
brew "prek"
brew "rbw"
brew "ripgrep"
brew "sheldon"
brew "sshpass"
brew "starship"
brew "tealdeer"
brew "tokei"
brew "uv"
brew "vivid"
brew "watchman"
brew "yq"
brew "zoxide"
cask "claude-code"
cask "easydict"
cask "eudic"
cask "font-im-writing-nerd-font"
cask "font-inter-tight"
cask "font-maple-mono-nf-cn"
cask "font-sarasa-gothic"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "jordanbaird-ice"
cask "keka"
cask "kitty"
cask "logi-options+"
cask "raycast"
cask "rio"
cask "shottr"
cask "slack"
cask "visual-studio-code"
cask "zed"
cask "zen"
vscode "aaron-bond.better-comments"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "fill-labs.dependi"
vscode "github.remotehub"
vscode "huytd.nord-light"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
{{ end }}
